package лаб1;

public class task2 {
    public static void main(String[] args) {
//        Выведите на экран значение строкового литерала "Задача 4131"
        System.out.println("Задача 4131");
//        Объявите переменную asdf строкового типа.
        String asdf;
//                Объявите переменную qaz строкового типа.
        String qaz;
//        Запишите в переменную asdf значение строкового литерала "фыва".
        asdf = "фыва";
//                Запишите в переменную qaz значение переменной asdf.
        qaz = asdf;
//        Выведите на экран значение переменной asdf.
        System.out.println(asdf);
//        Выведите на экран значение переменной qaz.
        System.out.println(qaz);
    }
}
//
