package лаб1;

public class task3 {
    public static void main(String[] args) {


//    Выведите в консоль значение строкового литерала "Задача 7365"
            System.out.println("Задача 7365");
    //        Объявите переменные hjkl и wsx строкового типа.
    String hjkl, wsx;
//                Запишите в переменную hjkl значение строкового литерала "ролд".
    hjkl="ролд";
//                Запишите в переменную wsx результат конкатенации переменной hjkl и строкового литерала "цычувс".
    wsx=hjkl+"цычувс";
//                Выведите в консоль значение переменной hjkl.
        System.out.println(hjkl);
//                Выведите в консоль значение переменной wsx.
        System.out.println(wsx);
}
}
