//package лаб6;
//
//import java.util.Scanner;
//
//public class task4 {
//    public static void main(String[] args) {
//        //
//        int i; //обьявляем переменную - счетчик
//        i = 453; //записываем в нее значение из первого фрагмента
//        int n; //обьявляем переменную ограничение
//        n = 19;
//        System.out.println("фунт    грамм");//Один раз перед циклом
//        while (i == n) {// счетчик сравниваем с ограничением. Повторяем пока истинно.
//            System.out.println("Глава " i);
//            i = i + 1; // изменияем по закономерности
//        }}}